{
  "acidentes": {
    "title": "Registro de acidentes",
    "summary": "Cadastro completo de acidentes com classificacao por agente/parte, historico, status e cancelamento controlado.",
    "steps": [
      {
        "title": "Preencher colaborador e ocorrencia",
        "description": "Selecione o colaborador (matricula/nome), data do acidente, centro de servico e local. Campos obrigatorios estao marcados com *.",
        "mediaHint": "Formulario de cadastro de acidentes com dados do colaborador e ocorrencia."
      },
      {
        "title": "Classificar agentes",
        "description": "Escolha um agente, selecione tipos e/ou lesoes e clique em Incluir para adicionar as combinacoes na tabela. E possivel incluir mais de um agente. Tipos e lesoes podem ter quantidades diferentes; o campo faltante fica em branco.",
        "mediaHint": "Bloco Classificacao Agentes com botao Incluir e tabela de combinacoes."
      },
      {
        "title": "Classificar partes lesionadas",
        "description": "Selecione uma ou mais partes lesionadas usando o seletor com chips. Cada parte adicionada aparece abaixo e pode ser removida.",
        "mediaHint": "Bloco Classificacao Partes lesionadas com multiselect."
      },
      {
        "title": "Impacto e complemento",
        "description": "Preencha dias perdidos e debitados, CID, CAT e observacao. CAT nao pode se repetir; CID pode se repetir.",
        "mediaHint": "Campos de impacto e complemento."
      },
      {
        "title": "Cadastro em massa",
        "description": "Use o botao Cadastrar em massa para enviar uma planilha XLSX com matricula, data, hora, dias_debitados, dias_perdidos, centro_servico, local, agentes, tipos, lesoes e partes.",
        "mediaHint": "Modal de importacao em massa com upload de XLSX."
      },
      {
        "title": "Exportar lista",
        "description": "Use o botao Exportar Excel (CSV) para baixar a lista filtrada de acidentes.",
        "mediaHint": "Botao Exportar Excel (CSV) ao lado de Atualizar na lista."
      },
      {
        "title": "Historico, detalhes e cancelamento",
        "description": "Use o botao de relogio para ver historico, o botao de olho para detalhes e o X para cancelar (exige motivo e marca como Cancelado).",
        "mediaHint": "Acoes na lista de acidentes."
      }
    ],
    "notes": [
      "E necessario informar ao menos um agente e pelo menos um tipo ou lesao por agente.",
      "No cadastro em massa, agentes/tipos/lesoes/partes usam ';' como separador e devem existir no catalogo.",
      "Se ja existir acidente para a mesma matricula e data, o sistema pede confirmacao antes de salvar.",
      "Ao salvar um acidente, a lista e recarregada automaticamente.",
      "Se algum dropdown estiver vazio, aguarde o carregamento ou revise integracoes de cadastro base.",
      "HHT nao e informado na ficha; o dashboard cruza data+centro com o HHT mensal ativo. Cancelados (ativo=false) nao entram nos calculos."
    ]
  }
}
