{
  "dashboard": {
    "title": "Dashboard de estoque",
    "summary": "Use esta tela para ver rapidamente movimentação, valores e alertas de estoque.",
    "steps": [
      {
        "title": "Aplicar filtros rápidos",
        "description": "No campo Busca digite parte do nome de material, grupo ou pessoa e combine com período inicial/final; clique em Aplicar filtros para recalcular todos os gráficos. Use Limpar filtros para voltar ao panorama completo.",
        "mediaHint": "Área de filtros no topo com período e campo de busca."
      },
      {
        "title": "Ler os cards de destaque",
        "description": "Os cards mostram totais consolidados (movimentado, saldo e alertas). Passe o mouse no ícone (i) para entender como cada indicador é calculado.",
        "mediaHint": "Cards de resumo com valores e ícones."
      },
      {
        "title": "Interagir com os gráficos",
        "description": "Clique em uma barra ou fatia para filtrar o restante dos gráficos pelo mesmo termo. Use o chip Limpar que aparece acima do gráfico para remover o filtro.",
        "mediaHint": "Gráfico com tooltip e chip de filtro ativo."
      },
      {
        "title": "Expandir gráficos",
        "description": "Para analisar um gráfico com mais espaço, clique no botão de expandir (canto superior direito do card). Feche clicando fora ou no ícone de fechar.",
        "mediaHint": "Botão de expandir no cabeçalho do card."
      }
    ],
    "notes": [
      "Os gráficos respeitam os filtros aplicados; se algo parecer zerado, confirme o período.",
      "O campo Busca aceita trechos de nome de material, grupo ou pessoa; termos parciais funcionam."
    ]
  },
  "dashboardAcidentes": {
    "title": "Dashboard de acidentes",
    "summary": "Monitore tendência, tipos de acidente e distribuições para SST.",
    "steps": [
      {
        "title": "Definir filtros iniciais",
        "description": "No campo Busca digite pessoa, agente ou local (trechos do nome/matrícula também funcionam) e combine com período e unidade/centro de serviço. Clique em Aplicar para recalcular os indicadores.",
        "mediaHint": "Filtros do dashboard de acidentes."
      },
      {
        "title": "Conferir indicadores-chave",
        "description": "Os cards exibem totais, taxas e comparativos. Use o texto de ajuda abaixo dos cards para saber como foi calculado.",
        "mediaHint": "Cards de KPI da tela de acidentes."
      },
      {
        "title": "Ler gráficos com tooltips",
        "description": "Use os botões (i) nos títulos para ver o que cada gráfico representa. Passe o mouse nos pontos/segmentos para ver valores detalhados.",
        "mediaHint": "Gráfico com tooltip e ícone de info."
      },
      {
        "title": "Abrir em tela cheia",
        "description": "Clique no botão de expandir do gráfico desejado. A visualização modal permite enxergar mais pontos sem poluição visual.",
        "mediaHint": "Modal de gráfico expandido."
      }
    ],
    "notes": [
      "Filtros são persistidos enquanto você navega pelo dashboard.",
      "Se nenhum dado aparecer, valide se o período contém registros de acidentes."
    ]
  },
  "estoque": {
    "title": "Estoque atual",
    "summary": "Consulta do saldo por material, alertas de mínimo e resumo financeiro.",
    "steps": [
      {
        "title": "Filtrar materiais",
        "description": "No campo Busca digite parte do nome, descrição, ID ou CA do material para reduzir a tabela; combine com centro de estoque e faixas de saldo. Clique em Aplicar para refinar ou em Limpar para remover todos os filtros.",
        "mediaHint": "Filtros de estoque e botões Aplicar/Limpar."
      },
      {
        "title": "Monitorar alertas",
        "description": "O bloco \"Alertas de estoque\" mostra itens abaixo do mínimo. Ajuste o mínimo diretamente na tabela se precisar recalibrar.",
        "mediaHint": "Tabela de alertas com status vermelho/alarme."
      },
      {
        "title": "Editar mínimo na tabela",
        "description": "Na lista principal, altere o valor de estoque mínimo no campo inline e clique em salvar ao lado para registrar a nova meta.",
        "mediaHint": "Campo editável de mínimo de estoque."
      },
      {
        "title": "Usar paginação",
        "description": "Navegue pelas páginas no rodapé da lista para ver mais itens. O total considera os filtros aplicados.",
        "mediaHint": "Controles de página na parte inferior da lista."
      }
    ],
    "notes": [
      "O resumo financeiro abaixo dos alertas usa o valor unitário cadastrado no material.",
      "Se um item não mostrar centro de custo, revise o cadastro do material."
    ]
  },
  "entradas": {
    "title": "Entradas de estoque",
    "summary": "Registro de novas entradas e consulta histórica.",
    "steps": [
      {
        "title": "Registrar nova entrada",
        "description": "Use o campo de busca para localizar o material por nome ou ID, escolha a sugestão correta e preencha quantidade, centro de estoque e data. Confira os valores e clique em Registrar entrada para salvar; o formulário limpa e o histórico é atualizado.",
        "mediaHint": "Formulário de cadastro de entradas com autocomplete."
      },
      {
        "title": "Aplicar filtros do histórico",
        "description": "Use o campo Busca para digitar parte do nome, descrição ou ID do material (ou do usuário que registrou) e combine com centro de estoque, status e período para refinar o histórico. Use Limpar para remover todos os filtros.",
        "mediaHint": "Filtros rápidos do histórico de entradas (inclui status)."
      },
      {
        "title": "Editar, ver histórico ou cancelar",
        "description": "Na tabela, use os ícones para cada entrada: olho (detalhes), lápis (editar), relógio (histórico) e X vermelho (cancelar). Entradas canceladas ficam esmaecidas e não exibem os botões de edição/cancelamento.",
        "mediaHint": "Ícones de detalhes, edição, histórico e cancelamento na linha."
      },
      {
        "title": "Atualizar dados",
        "description": "Clique em Atualizar no cabeçalho da lista para recarregar dados e sugestões de materiais.",
        "mediaHint": "Botão Atualizar no topo da seção de histórico."
      }
    ],
    "notes": [
      "O campo Material aceita ID ou nome parcial; o dropdown mostra ID e descrição.",
      "Se não houver centros de estoque configurados, o campo vira texto livre para não travar o registro.",
      "Status e usuário de edição aparecem em detalhes e histórico; cancelamentos são registrados.",
      "Filtros de status usam a lista configurada em status_entrada (REGISTRADO/CANCELADO por padrão)."
    ]
  },
  "saidas": {
    "title": "Saídas de estoque",
    "summary": "Entrega de EPIs para pessoas, com rastreabilidade e cancelamento.",
    "steps": [
      {
        "title": "Registrar saída",
        "description": "No campo de busca, digite o nome ou matrícula para achar a pessoa e selecione o material pelo autocomplete. Informe quantidade, centro de estoque e data; confira o saldo exibido ao lado e clique em Registrar saída para gravar a entrega.",
        "mediaHint": "Formulário de cadastro de saídas com busca de pessoa e material."
      },
      {
        "title": "Conferir saldo disponível",
        "description": "Ao selecionar o material, a caixa lateral mostra saldo por centro de estoque para evitar liberações acima do estoque.",
        "mediaHint": "Bloco de saldo do material ao lado do formulário."
      },
      {
        "title": "Editar ou cancelar",
        "description": "Clique em Editar para carregar o registro no formulário: ele sobe para o topo, fica amarelo e mostra “Editando...”. Ajuste os campos necessários e clique em Salvar alterações para gravar; se desistir antes de salvar, use Cancelar edição para voltar ao modo de cadastro.",
        "mediaHint": "Ações de edição e cancelamento na tabela de saídas."
      },
      {
        "title": "Filtrar e paginar",
        "description": "No campo Busca digite o nome ou matrícula da pessoa, ou nome/descrição/ID do material ou CA, para trazer apenas as saídas relacionadas; complemente com filtros de centro e status. Aplique, limpe se necessário e navegue pelas páginas no rodapé.",
        "mediaHint": "Filtros superiores e paginação inferior do histórico."
      }
    ],
    "notes": [
      "Saídas canceladas ficam marcadas e não impactam o saldo.",
      "O histórico detalha quem registrou e quando a entrega foi alterada."
    ]
  },
  "materiais": {
    "title": "Cadastro de materiais / EPI",
    "summary": "Cadastro centralizado de EPI com variações, características e valor.",
    "steps": [
      {
        "title": "Cadastrar ou editar material",
        "description": "Preencha nome, grupo, valor unitário e CA (quando houver). Ao editar, o título muda para “Editando...” e o card fica destacado em amarelo; use Salvar para novo cadastro ou para gravar alterações.",
        "mediaHint": "Formulário principal de materiais."
      },
      {
        "title": "Gerenciar variações e atributos",
        "description": "Adicione características, cores, fabricante e tamanho pelo autocomplete. Campos de lista aceitam múltiplos itens.",
        "mediaHint": "Campos de característica, cor e tamanho."
      },
      {
        "title": "Filtrar catálogo",
        "description": "Digite no campo Busca parte do nome, descrição, ID ou CA para filtrar rapidamente o catálogo; refine por grupo, tamanho, fabricante ou característica e clique em Aplicar. Limpar remove todos os filtros.",
        "mediaHint": "Bloco de filtros acima da tabela de materiais."
      },
      {
        "title": "Histórico e detalhes",
        "description": "Na tabela use o botão de relógio para ver histórico de alterações e o botão com olho para abrir o detalhamento completo do material.",
        "mediaHint": "Ações de histórico e detalhes na tabela de materiais."
      }
    ],
    "notes": [
      "A edição de um material reaproveita o mesmo formulário, mantendo os campos preenchidos.",
      "Valor unitário é usado nos cálculos de estoque e relatórios."
    ]
  },
  "pessoas": {
    "title": "Cadastro de pessoas",
    "summary": "Registro de colaboradores com histórico de edições e filtros.",
    "steps": [
      {
        "title": "Cadastrar ou atualizar colaborador",
        "description": "Informe nome, documento, centro de serviço e cargo. Ao editar, o formulário fica com borda amarela e o título mostra “Editando...” para indicar o modo de edição; use Salvar para novo registro ou para concluir a edição.",
        "mediaHint": "Formulário principal de pessoas."
      },
      {
        "title": "Filtrar lista",
        "description": "No campo Busca digite nome ou matrícula para filtrar a tabela de pessoas; termos parciais funcionam. Combine com centro de serviço ou setor e clique em Aplicar. O botão Limpar remove todos os filtros.",
        "mediaHint": "Filtros e chips acima da tabela de pessoas."
      },
      {
        "title": "Ler resumo rápido",
        "description": "Os cards de resumo mostram quantidade por centro e setores mais frequentes conforme o filtro aplicado.",
        "mediaHint": "Cards de resumo logo após os filtros."
      },
      {
        "title": "Ver histórico de alterações",
        "description": "Na tabela, clique no botão de relógio (Histórico) para ver quem alterou dados do colaborador e quando.",
        "mediaHint": "Modal de histórico de pessoas."
      }
    ],
    "notes": [
      "O formulário permanece preenchido ao iniciar uma edição para evitar retrabalho.",
      "Use o botão Atualizar na tabela para forçar recarga de dados do servidor."
    ]
  },
  "acidentes": {
    "title": "Registro de acidentes",
    "summary": "Cadastro completo de acidentes com filtros, histórico e detalhes.",
    "steps": [
      {
        "title": "Preencher dados do acidente",
        "description": "Selecione colaborador, tipo de acidente, lesão e parte afetada. Campos obrigatórios estão marcados com *. Ao editar, o título muda para “Editando...” e o card fica destacado em amarelo; use Salvar para gravar.",
        "mediaHint": "Formulário de cadastro de acidentes."
      },
      {
        "title": "Relacionar local e agente",
        "description": "Use os campos de local, centro de serviço e agente causador para enriquecer indicadores de SST.",
        "mediaHint": "Seção de local/agente dentro do formulário."
      },
      {
        "title": "Filtrar registros",
        "description": "Use o campo Busca para digitar pessoa (nome/matrícula), agente ou local, inclusive termos parciais, e filtrar rapidamente; refine por tipo, centro de serviço ou agente e clique em Aplicar. Limpar zera todos os filtros.",
        "mediaHint": "Bloco de filtros acima da lista de acidentes."
      },
      {
        "title": "Consultar histórico e detalhes",
        "description": "Clique no botão de relógio para ver histórico de alterações ou no botão com olho para abrir os detalhes completos do acidente.",
        "mediaHint": "Modal de detalhes do acidente."
      }
    ],
    "notes": [
      "Ao salvar um acidente, a lista é recarregada automaticamente.",
      "Se algum dropdown estiver vazio, aguarde o carregamento ou revise integrações de cadastro base."
    ]
  },
  "termoEpi": {
    "title": "Termo de EPI",
    "summary": "Gere e baixe o termo de responsabilidade de EPI para colaboradores.",
    "steps": [
      {
        "title": "Preencher filtros de busca",
        "description": "No campo Busca informe matrícula ou nome do colaborador (parcial ou completo) e, se quiser, complete com intervalo de datas de entrega. Não é necessário preencher todos os campos.",
        "mediaHint": "Formulário de filtros do termo."
      },
      {
        "title": "Gerar documento",
        "description": "Clique em Gerar termo para montar a pré-visualização. Use Limpar para reiniciar os campos.",
        "mediaHint": "Botões Gerar termo e Limpar."
      },
      {
        "title": "Analise a pré-visualização",
        "description": "Revise os dados do colaborador e dos itens entregues no iframe exibido. O badge indica se o documento veio do cache local ou do servidor.",
        "mediaHint": "Iframe de pré-visualização do termo."
      },
      {
        "title": "Baixar PDF",
        "description": "Com a pré-visualização carregada, clique em Baixar PDF no cabeçalho da seção para salvar o arquivo.",
        "mediaHint": "Botão Baixar PDF acima do iframe."
      }
    ],
    "notes": [
      "Se nenhum HTML for retornado, revise os filtros ou gere novas entregas antes.",
      "O download só habilita depois que o HTML estiver carregado."
    ]
  },
  "configuracoes": {
    "title": "Configurações da conta",
    "summary": "Credenciais, páginas permitidas e ajustes de senha/envio de reset.",
    "steps": [
      {
        "title": "Escolher usuário",
        "description": "Selecione um usuário cadastrado para editar suas permissões.",
        "mediaHint": "Dropdown de usuário."
      },
      {
        "title": "Definir credencial e status",
        "description": "Use os seletores para ajustar a credencial (admin/operador/visitante) e o status ativo/inativo. Apenas master/admin podem alterar.",
        "mediaHint": "Seletores de credencial e switch de status."
      },
      {
        "title": "Liberar ou bloquear páginas",
        "description": "Ative/desative os toggles de cada página para definir o acesso. Se não houver lista salva, usamos o padrão da credencial.",
        "mediaHint": "Toggles de páginas em duas colunas."
      },
      {
        "title": "Salvar alterações",
        "description": "Clique em Salvar credencial para persistir as mudanças. O histórico registra credencial, páginas e status.",
        "mediaHint": "Botão Salvar credencial."
      },
      {
        "title": "Reset de senha (admin)",
        "description": "Admins podem enviar o e-mail de redefinição para o usuário selecionado (exceto master). Em modo local fica indisponível.",
        "mediaHint": "Botão de reset de senha."
      },
      {
        "title": "Ver histórico",
        "description": "Abra o histórico para ver quem alterou credencial/páginas/status ou disparou reset de senha.",
        "mediaHint": "Botão de histórico de credenciais."
      }
    ],
    "notes": [
      "Credencial master fica oculta para edição e reset.",
      "Em modo local, reset de senha fica indisponível.",
      "Se page_permissions estiver vazio, o padrão da credencial é aplicado nos toggles."
    ]
  }
}
