{
  "analiseEstoque": {
    "title": "Analise de estoque",
    "summary": "Centralize os Paretos e indicadores de acao para decisao rapida sobre estoque.",
    "steps": [
      {
        "title": "Aplicar filtros",
        "description": "Use Periodo inicial/final e Busca para recalcular os Paretos e os cartoes de decisao."
      },
      {
        "title": "Ler os cartoes de decisao",
        "description": "Os cartoes resumem concentracao, risco, financeiro e recomendacoes automaticas para priorizar acoes."
      },
      {
        "title": "Interpretar os Paretos",
        "description": "Cada Pareto vem com interpretacao e acao recomendada ao lado. Use o bloco para orientar compras e controle."
      },
      {
        "title": "Previsao rolling",
        "description": "O card mostra a previsao de fluxo (entradas, saidas e saldo) com sazonalidade e fator_tendencia robusto."
      },
      {
        "title": "Copiar IDs",
        "description": "Clique em barras com ID para copiar o materialId e usar em consultas ou cadastros."
      }
    ],
    "notes": [
      "Pareto 80/20 - Saida por quantidade responde: \"O que mais sai fisicamente?\".",
      "Pareto de score de risco responde: \"O que nao pode faltar de jeito nenhum?\". Ordena pelo score (alto para baixo) e colore as barras por faixa de score (alto/medio/baixo).",
      "Pareto financeiro - Saida por valor responde: \"O que doi mais no caixa?\".",
      "Risco operacional: Classe A = abaixo minimo + giro alto; Classe B = abaixo minimo; Classe C = acima do minimo.",
      "A previsao rolling nao usa filtros de periodo: considera sempre os ultimos 12 meses completos.",
      "O periodo exibido pode ser selecionado no combo com historicos gerados.",
      "O botao Validacao da previsao mostra as tabelas de gasto mensal e previsao mensal.",
      "O botao Diagnostico abre um modal com estatisticas mensais (mediana, P75, P90).",
      "Cron pode usar body {\"force\": true} para rodar fora do ultimo dia do mes.",
      "Os dados do card e grafico de previsao sao lidos das tabelas agregadas (nao ha calculo no client).",
      "Fator_tendencia = 0.6*(ultimos 3m / anteriores 3m) + 0.4*(1 + slope*30*6/ultimos 3m).",
      "Sazonalidade media do periodo e calculada a partir da media movel de 3 meses (aplicada junto com fator_tendencia).",
      "Previsao de entrada usa media movel 3m de entrada e fator sazonal de entrada.",
      "Tooltip da previsao mostra contingencia (P75), P90, mediana e alerta de volatilidade (CV > 1) calculados no RPC.",
      "Previsao inclui entradas e saidas, com saldo anual no card.",
      "Diagnostico usa agg_gasto_mensal (valor_saida) para estatisticas mensais."
      ]
    }
}
