{
  "entradas": {
    "title": "Entradas de estoque",
    "summary": "Registro de novas entradas e consulta historica.",
    "steps": [
      {
        "title": "Registrar nova entrada",
        "description": "Primeiro selecione o Centro de estoque (*). O campo Material so e liberado apos escolher o centro. Em seguida, use o autocomplete para buscar e selecionar o material por nome ou ID. Preencha quantidade e data e clique em Registrar entrada para salvar. Dica: ao acessar a tela pelo Estoque atual, Centro de estoque e Material podem vir pre-preenchidos.",
        "mediaHint": "Formulario de cadastro de entradas: Centro de estoque, Material (habilita apos selecionar o centro), Quantidade e Data."
      },
      {
        "title": "Aplicar filtros do historico",
        "description": "Use o campo Busca para digitar parte do nome, descricao ou ID do material (ou do usuario que registrou) e combine com centro de estoque, status e periodo para refinar o historico. Use Limpar para remover todos os filtros.",
        "mediaHint": "Filtros rapidos do historico de entradas (inclui status)."
      },
      {
        "title": "Editar, ver historico ou cancelar",
        "description": "Na tabela, use os icones para cada entrada: olho (detalhes), lapis (editar), relogio (historico) e X vermelho (cancelar). Entradas canceladas ficam esmaecidas e nao exibem os botoes de edicao/cancelamento. O cancelamento e bloqueado se as saidas ativas ficarem maiores que o saldo sem essa entrada; ajuste/estorne saidas antes.",
        "mediaHint": "Icones de detalhes, edicao, historico e cancelamento na linha."
      },
      {
        "title": "Atualizar dados",
        "description": "Clique em Atualizar no cabecalho da lista para recarregar dados e sugestoes de materiais.",
        "mediaHint": "Botao Atualizar no topo da secao de historico."
      }
    ],
    "notes": [
      "O campo Material aceita ID ou nome parcial; o dropdown mostra ID e descricao.",
      "O filtro de Busca no historico aceita ID do material.",
      "Se nao houver centros de estoque configurados, o campo vira texto livre para nao travar o registro.",
      "Atalho: vindo do Estoque atual, o formulario pode abrir com Centro de estoque e Material ja preenchidos.",
      "Status e usuario de edicao aparecem em detalhes e historico; cancelamentos sao registrados.",
      "Filtros de status usam a lista configurada em status_entrada (REGISTRADO/CANCELADO por padrao).",
      "Nao e possivel cancelar uma entrada se as saidas vigentes superarem o estoque que restaria sem ela; reduza ou estorne saidas primeiro."
    ]
  }
}
