{
  "dashboard": {
    "title": "Dashboard de estoque",
    "summary": "Use esta tela para ver rapidamente movimentação, valores e alertas de estoque.",
    "steps": [
      {
        "title": "Aplicar filtros rápidos",
        "description": "Defina período inicial/final ou um termo de busca e clique em Aplicar filtros para recalcular todos os gráficos. Use Limpar filtros para voltar ao panorama completo.",
        "mediaHint": "Área de filtros no topo com período e campo de busca."
      },
      {
        "title": "Ler os cards de destaque",
        "description": "Os cards mostram totais consolidados (movimentado, saldo e alertas). Passe o mouse no ícone (i) para entender como cada indicador é calculado.",
        "mediaHint": "Cards de resumo com valores e ícones."
      },
      {
        "title": "Interagir com os gráficos",
        "description": "Clique em uma barra ou fatia para filtrar o restante dos gráficos pelo mesmo termo. Use o chip Limpar que aparece acima do gráfico para remover o filtro.",
        "mediaHint": "Gráfico com tooltip e chip de filtro ativo."
      },
      {
        "title": "Expandir gráficos",
        "description": "Para analisar um gráfico com mais espaço, clique no botão de expandir (canto superior direito do card). Feche clicando fora ou no ícone de fechar.",
        "mediaHint": "Botão de expandir no cabeçalho do card."
      }
    ],
    "notes": [
      "Os gráficos respeitam os filtros aplicados; se algo parecer zerado, confirme o período.",
      "O filtro por termo aceita trechos de nome de material, grupo ou pessoa."
    ]
  },
  "dashboardAcidentes": {
    "title": "Dashboard de acidentes",
    "summary": "Monitore tendência, tipos de acidente e distribuições para SST.",
    "steps": [
      {
        "title": "Definir filtros iniciais",
        "description": "Escolha período, unidade/centro de serviço e demais filtros no bloco superior. Clique em Aplicar para recalcular os indicadores.",
        "mediaHint": "Filtros do dashboard de acidentes."
      },
      {
        "title": "Conferir indicadores-chave",
        "description": "Os cards exibem totais, taxas e comparativos. Use o texto de ajuda abaixo dos cards para saber como foi calculado.",
        "mediaHint": "Cards de KPI da tela de acidentes."
      },
      {
        "title": "Ler gráficos com tooltips",
        "description": "Use os botões (i) nos títulos para ver o que cada gráfico representa. Passe o mouse nos pontos/segmentos para ver valores detalhados.",
        "mediaHint": "Gráfico com tooltip e ícone de info."
      },
      {
        "title": "Abrir em tela cheia",
        "description": "Clique no botão de expandir do gráfico desejado. A visualização modal permite enxergar mais pontos sem poluição visual.",
        "mediaHint": "Modal de gráfico expandido."
      }
    ],
    "notes": [
      "Filtros são persistidos enquanto você navega pelo dashboard.",
      "Se nenhum dado aparecer, valide se o período contém registros de acidentes."
    ]
  },
  "estoque": {
    "title": "Estoque atual",
    "summary": "Consulta do saldo por material, alertas de mínimo e resumo financeiro.",
    "steps": [
      {
        "title": "Filtrar materiais",
        "description": "Use o formulário de filtros para buscar por nome, centro de estoque ou faixas de estoque. Clique em Aplicar ou Limpar para atualizar a lista.",
        "mediaHint": "Filtros de estoque e botões Aplicar/Limpar."
      },
      {
        "title": "Monitorar alertas",
        "description": "O bloco \"Alertas de estoque\" mostra itens abaixo do mínimo. Ajuste o mínimo diretamente na tabela se precisar recalibrar.",
        "mediaHint": "Tabela de alertas com status vermelho/alarme."
      },
      {
        "title": "Editar mínimo na tabela",
        "description": "Na lista principal, altere o valor de estoque mínimo no campo inline e clique em salvar ao lado para registrar a nova meta.",
        "mediaHint": "Campo editável de mínimo de estoque."
      },
      {
        "title": "Usar paginação",
        "description": "Navegue pelas páginas no rodapé da lista para ver mais itens. O total considera os filtros aplicados.",
        "mediaHint": "Controles de página na parte inferior da lista."
      }
    ],
    "notes": [
      "O resumo financeiro abaixo dos alertas usa o valor unitário cadastrado no material.",
      "Se um item não mostrar centro de custo, revise o cadastro do material."
    ]
  },
  "entradas": {
    "title": "Entradas de estoque",
    "summary": "Registro de novas entradas e consulta histórica.",
    "steps": [
      {
        "title": "Registrar nova entrada",
        "description": "Busque o material pelo nome/ID, informe quantidade, centro de estoque e data. Clique em Registrar entrada ou Salvar alterações quando estiver editando.",
        "mediaHint": "Formulário de cadastro de entradas com autocomplete."
      },
      {
        "title": "Aplicar filtros do histórico",
        "description": "Filtre por usuário, centro de estoque ou período para listar somente as entradas relevantes. Use Limpar para remover todos os filtros.",
        "mediaHint": "Filtros rápidos do histórico de entradas."
      },
      {
        "title": "Editar ou ver histórico",
        "description": "Na tabela, use o ícone de lápis para editar e o relógio para abrir o histórico daquela entrada.",
        "mediaHint": "Ações de edição e histórico na tabela."
      },
      {
        "title": "Atualizar dados",
        "description": "Clique em Atualizar no cabeçalho da lista para recarregar dados e sugestões de materiais.",
        "mediaHint": "Botão Atualizar no topo da seção de histórico."
      }
    ],
    "notes": [
      "O campo Material aceita ID ou nome parcial; o dropdown mostra ID e descrição.",
      "Se não houver centros de estoque configurados, o campo vira texto livre para não travar o registro."
    ]
  },
  "saidas": {
    "title": "Saídas de estoque",
    "summary": "Entrega de EPIs para pessoas, com rastreabilidade e cancelamento.",
    "steps": [
      {
        "title": "Registrar saída",
        "description": "Selecione a pessoa e o material pelo autocomplete, informe quantidade, centro de estoque e data. Salve para registrar a entrega.",
        "mediaHint": "Formulário de cadastro de saídas com busca de pessoa e material."
      },
      {
        "title": "Conferir saldo disponível",
        "description": "Ao selecionar o material, a caixa lateral mostra saldo por centro de estoque para evitar liberações acima do estoque.",
        "mediaHint": "Bloco de saldo do material ao lado do formulário."
      },
      {
        "title": "Editar ou cancelar",
        "description": "Use o ícone de lápis para editar registros recentes. O botão Cancelar abre um modal para registrar o motivo e bloquear a entrega.",
        "mediaHint": "Ações de edição e cancelamento na tabela de saídas."
      },
      {
        "title": "Filtrar e paginar",
        "description": "Use filtros por pessoa, material, centro e status para encontrar uma saída específica. Navegue pelas páginas no rodapé.",
        "mediaHint": "Filtros superiores e paginação inferior do histórico."
      }
    ],
    "notes": [
      "Saídas canceladas ficam marcadas e não impactam o saldo.",
      "O histórico detalha quem registrou e quando a entrega foi alterada."
    ]
  },
  "materiais": {
    "title": "Cadastro de materiais / EPI",
    "summary": "Cadastro centralizado de EPI com variações, características e valor.",
    "steps": [
      {
        "title": "Cadastrar ou editar material",
        "description": "Preencha nome, grupo, valor unitário e CA (quando houver). Use o botão Salvar para novo cadastro ou para gravar alterações.",
        "mediaHint": "Formulário principal de materiais."
      },
      {
        "title": "Gerenciar variações e atributos",
        "description": "Adicione características, cores, fabricante e tamanho pelo autocomplete. Campos de lista aceitam múltiplos itens.",
        "mediaHint": "Campos de característica, cor e tamanho."
      },
      {
        "title": "Filtrar catálogo",
        "description": "Filtre por grupo, tamanho, fabricante ou característica para localizar itens cadastrados. Clique em Limpar para remover filtros.",
        "mediaHint": "Bloco de filtros acima da tabela de materiais."
      },
      {
        "title": "Histórico e detalhes",
        "description": "Na tabela use o relógio para ver histórico de alterações e o olho para abrir o detalhamento completo do material.",
        "mediaHint": "Ações de histórico e detalhes na tabela de materiais."
      }
    ],
    "notes": [
      "A edição de um material reaproveita o mesmo formulário, mantendo os campos preenchidos.",
      "Valor unitário é usado nos cálculos de estoque e relatórios."
    ]
  },
  "pessoas": {
    "title": "Cadastro de pessoas",
    "summary": "Registro de colaboradores com histórico de edições e filtros.",
    "steps": [
      {
        "title": "Cadastrar ou atualizar colaborador",
        "description": "Informe nome, documento, centro de serviço e cargo. Use Salvar para novo registro ou para concluir uma edição.",
        "mediaHint": "Formulário principal de pessoas."
      },
      {
        "title": "Filtrar lista",
        "description": "Busque por termo, centro de serviço ou setor para limitar a tabela. O botão Limpar remove todos os filtros.",
        "mediaHint": "Filtros e chips acima da tabela de pessoas."
      },
      {
        "title": "Ler resumo rápido",
        "description": "Os cards de resumo mostram quantidade por centro e setores mais frequentes conforme o filtro aplicado.",
        "mediaHint": "Cards de resumo logo após os filtros."
      },
      {
        "title": "Ver histórico de alterações",
        "description": "Na tabela, clique em Histórico para ver quem alterou dados do colaborador e quando.",
        "mediaHint": "Modal de histórico de pessoas."
      }
    ],
    "notes": [
      "O formulário permanece preenchido ao iniciar uma edição para evitar retrabalho.",
      "Use o botão Atualizar na tabela para forçar recarga de dados do servidor."
    ]
  },
  "acidentes": {
    "title": "Registro de acidentes",
    "summary": "Cadastro completo de acidentes com filtros, histórico e detalhes.",
    "steps": [
      {
        "title": "Preencher dados do acidente",
        "description": "Selecione colaborador, tipo de acidente, lesão e parte afetada. Campos obrigatórios estão marcados com *. Use Salvar para gravar.",
        "mediaHint": "Formulário de cadastro de acidentes."
      },
      {
        "title": "Relacionar local e agente",
        "description": "Use os campos de local, centro de serviço e agente causador para enriquecer indicadores de SST.",
        "mediaHint": "Seção de local/agente dentro do formulário."
      },
      {
        "title": "Filtrar registros",
        "description": "Filtre por tipo, centro de serviço ou agente para reduzir a tabela. Limpar remove todos os filtros aplicados.",
        "mediaHint": "Bloco de filtros acima da lista de acidentes."
      },
      {
        "title": "Consultar histórico e detalhes",
        "description": "Clique no relógio para ver histórico de alterações ou no ícone de visualizar para abrir os detalhes completos do acidente.",
        "mediaHint": "Modal de detalhes do acidente."
      }
    ],
    "notes": [
      "Ao salvar um acidente, a lista é recarregada automaticamente.",
      "Se algum dropdown estiver vazio, aguarde o carregamento ou revise integrações de cadastro base."
    ]
  },
  "termoEpi": {
    "title": "Termo de EPI",
    "summary": "Gere e baixe o termo de responsabilidade de EPI para colaboradores.",
    "steps": [
      {
        "title": "Preencher filtros de busca",
        "description": "Informe matrícula, nome ou um intervalo de datas de entrega. Não é necessário preencher todos os campos.",
        "mediaHint": "Formulário de filtros do termo."
      },
      {
        "title": "Gerar documento",
        "description": "Clique em Gerar termo para montar a pré-visualização. Use Limpar para reiniciar os campos.",
        "mediaHint": "Botões Gerar termo e Limpar."
      },
      {
        "title": "Analise a pré-visualização",
        "description": "Revise os dados do colaborador e dos itens entregues no iframe exibido. O badge indica se o documento veio do cache local ou do servidor.",
        "mediaHint": "Iframe de pré-visualização do termo."
      },
      {
        "title": "Baixar PDF",
        "description": "Com a pré-visualização carregada, clique em Baixar PDF no cabeçalho da seção para salvar o arquivo.",
        "mediaHint": "Botão Baixar PDF acima do iframe."
      }
    ],
    "notes": [
      "Se nenhum HTML for retornado, revise os filtros ou gere novas entregas antes.",
      "O download só habilita depois que o HTML estiver carregado."
    ]
  },
  "configuracoes": {
    "title": "Configurações da conta",
    "summary": "Troca de senha e ajustes pessoais do usuário logado.",
    "steps": [
      {
        "title": "Preencher dados",
        "description": "Informe a senha atual e defina a nova senha com confirmação. Todos os campos são obrigatórios.",
        "mediaHint": "Formulário de troca de senha."
      },
      {
        "title": "Validar requisitos",
        "description": "A nova senha precisa ter pelo menos 8 caracteres e combinar com o campo de confirmação.",
        "mediaHint": "Mensagem de feedback abaixo do formulário."
      },
      {
        "title": "Salvar",
        "description": "Clique em Salvar senha. A aplicação reautentica com a senha atual para garantir segurança.",
        "mediaHint": "Botão Salvar e indicador de carregamento."
      },
      {
        "title": "Resolver erros",
        "description": "Mensagens em vermelho indicam erros de validação ou falha na comunicação com o Supabase. Ajuste e tente novamente.",
        "mediaHint": "Feedback de erro abaixo dos campos."
      }
    ],
    "notes": [
      "É preciso estar logado para trocar senha.",
      "Nenhuma outra configuração é alterada nesta tela; o foco é apenas credencial."
    ]
  }
}
